Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Secure your web endpoints with authorizations.
zh_cn: 用授权来保护你的网络端点。

source: Security
zh_cn: 安全

source: Security Customization
zh_cn: 安全定制

source: Security Integration
zh_cn: 安全集成

source: Security Overview
zh_cn: 安全概述

source: Security Testing
zh_cn: 安全测试

source: Security architecture
zh_cn: 安全架构

source: SecurityIdentity roles can be mapped from the verified JWT access tokens as follows:
zh_cn: 安全身份(SecurityIdentity)角色可以从经过验证的JWT访问令牌中映射出来，具体如下:

source: See <<keycloak-dev-mode, Running the Application in Dev mode>> section above about testing your application in a dev mode.
zh_cn: 关于在开发模式下测试您的应用程序，请参见上面 link:#keycloak-dev-mode[在开发模式下运行应用程序] 一节。

source: See current increments keys
zh_cn: 查看当前增量键的列表

source: See link:https://quarkus.io/blog/path-resolution-in-quarkus/[Path Resolution in Quarkus] for more information.
zh_cn: 更多信息见 link:https://quarkus.io/blog/path-resolution-in-quarkus/[Quarkus中的路径解析] 。

source: See the equivalent methods from the imperative example with the reactive variant:
zh_cn: 请参阅带有响应变形的命令式示例中的等效方法：

source: See the xref:container-image.adoc[Container Image guide] for more details.
zh_cn: 更多细节见 xref:container-image.adoc[容器镜像指南] 。

source: See the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] for further details on this topic.
zh_cn: 关于这个话题的更多细节，请看 link:quarkus-reactive-architecture.html[Quarkus响应式架构文档] 。

source: See the xref:security-openid-connect.adoc[Using OpenID Connect to Protect Service Applications] guide for more information about `Bearer Token` authentication mechanism. It is important to realize that it is the `Bearer Token` authentication mechanism which does the authentication and creates a security identity - while the `quarkus-keycloak-authorization` extension is responsible for applying a Keycloak Authorization Policy to this identity based on the current request path and other policy settings.
zh_cn: 关于 `Bearer Token` 认证机制的更多信息，请参见 link:security-openid-connect.html[使用OpenID Connect保护服务应用] 指南。重要的是，是 `Bearer Token` 认证机制来进行认证并创建一个安全身份 - 同时 `quarkus-keycloak-authorization` 扩展负责根据当前的请求路径和其他策略设置对该身份来应用Keycloak授权策略。

source: See xref:security-jwt-build.adoc[Generate JWT tokens with SmallRye JWT] and learn how to generate the encrypted or inner-signed and then encrypted tokens fast.
zh_cn: 请参阅 link:smallrye-jwt-build.html[使用SmallRye JWT生成JWT令牌] ，了解如何快速生成加密的或内部签名然后加密的令牌。

source: Selected Filters
zh_cn: 选定的筛选

source: Send a message to the address `greeting`. Message payload is `name`
zh_cn: 发送消息到地址 `greeting` 。消息的有效载荷是 `name`

source: Send back the current counter value
zh_cn: 返回当前计数器的值

source: Send the managed instance to Kafka. Make sure we wait for the message to complete before closing the transaction.
zh_cn: 将管理的实例发送到Kafka。确保我们在事务关闭之前等待消息的完成。

source: Send the message to Kafka, the `send` method returns a `CompletionStage`
zh_cn: 将消息发送到Kafka后， `send` 方法会返回一个 `CompletionStage`

source: Sending AMQP messages
zh_cn: 发送AMQP消息

source: Sending Cloud Events
zh_cn: 发送云事件

source: Sending Emails using SMTP
zh_cn: 使用SMTP发送邮件

source: Sending a payload returns a `CompletionStage`, completed when the message is acked. If the message transmission fails, the `CompletionStage` is completed exceptionally with the reason of the nack.
zh_cn: 发送一个payload会返回一个 `CompletionStage` ，并且它会在消息被确认时完成。如果消息传输失败， `CompletionStage` 会以异常结束，并且包含未被确认的原因。

source: Sending and publishing messages use the Vert.x event bus:
zh_cn: 发送和发布消息使用Vert.x事件总线。

source: Sending messages
zh_cn: 发送信息

source: Sending messages to Kafka
zh_cn: 向Kafka发送消息

source: Sending messages with @Emitter
zh_cn: 使用@Emitter发送消息

source: Sending quote request
zh_cn: 发送报价请求

source: Separating Java and native image compilation
zh_cn: Java和原生镜像分开编译

source: Separator for splitting a string which may contain multiple group values. It will only be used if the `smallrye.jwt.path.groups` property points to a custom claim whose value is a string. The default value is a single space because a standard OAuth2 `scope` claim may contain a space separated sequence.
zh_cn: 分隔符，用于分割一个可能包含多个组值的字符串。只有当 `smallrye.jwt.path.groups` 属性指向一个值为字符串的自定义声明时，它才会被使用。默认值是一个单一的空格，因为一个标准的OAuth2 `scope` 声明可能包含一个空格分隔的序列。

source: Serialization
zh_cn: 序列化

source: Serializer/deserializer autodetection
zh_cn: 序列化/反串行器自动侦测

source: Serializing via JSON-B
zh_cn: 通过JSON-B进行序列化

source: Serializing via Jackson
zh_cn: 通过Jackson进行序列化

source: Set `quarkus.oidc.authentication.user-info-required=true` if a UserInfo JSON object from the OIDC userinfo endpoint has to be requested. A request will be sent to the OpenID Provider UserInfo endpoint and an `io.quarkus.oidc.UserInfo` (a simple `javax.json.JsonObject` wrapper) object will be created. `io.quarkus.oidc.UserInfo` can be either injected or accessed as a SecurityIdentity `userinfo` attribute.
zh_cn: 如果要从OIDC userinfo端点请求UserInfo JSON对象，那么要设置 `quarkus.oidc.authentication.user-info-required=true` 。一个请求将被发送到OpenID Provider UserInfo端点，并将创建一个 `io.quarkus.oidc.UserInfo` （一个简单的 `javax.json.JsonObject` 包装器）对象。 `io.quarkus.oidc.UserInfo` 可以被注入或作为SecurityIdentity `userinfo` 属性访问。

source: Set durable to false
zh_cn: 将durable设为false

source: Set of trusted hostnames. If the keys have to be fetched over `HTTPS` and `smallrye.jwt.client.tls.trust-all` is set to `false` then this property can be used to configure the trusted hostnames.
zh_cn: 受信任的主机名的集合。如果钥匙必须通过 `HTTPS` 获得，并且 `smallrye.jwt.client.tls.trust-all` 被设置为 `false` ，那么这个属性可以用来配置可信的主机名。

source: Set the `owasp-dependency-check-plugin.version` value to `7.1.1` or later.
zh_cn: 其中 `owasp-dependency-check-plugin.version` 应该设置为 `7.1.1` 或更高。

source: Set the codec to use to receive the message
zh_cn: 设置用于接收信息的编解码器

source: Set the name of the codec to use to send the message
zh_cn: 设置用于发送消息的编解码器的名称

source: Set this property if another header such as `Cookie` is used to pass the token.
zh_cn: 如果使用另一个header（如 `Cookie` ）来传递令牌，则设置此属性。

source: Set this property if another header such as `Cookie` is used to pass the token. This property is deprecated - use 'mp.jwt.token.header'.
zh_cn: 如果使用另一个header，如 `Cookie` ，来传递令牌，则设置此属性。此属性已被废弃—请使用 `mp.jwt.token.header` 。

source: Set this property to `true` for `Authorization` header be checked even if the `smallrye.jwt.token.header` is set to `Cookie` but no cookie with a `smallrye.jwt.token.cookie` name exists.
zh_cn: 如果将此属性设置为 `true` ，`Authorization` header也会被检查，即使 `smallrye.jwt.token.header` 被设置为 `Cookie` ，但又不存在名称为 `smallrye.jwt.token.cookie` 的cookie。

source: Set this property to a specific key format such as `PEM_KEY`, `PEM_CERTIFICATE`, `JWK` or `JWK_BASE64URL` to optimize the way the verification key is loaded.
zh_cn: 将此属性设置为特定的密钥格式，如 `PEM_KEY` , `PEM_CERTIFICATE` , `JWK` 或 `JWK_BASE64URL` ，以优化验证密钥的加载方式。

source: Setting it up
zh_cn: 设置它

source: Setting the consumer rebalance listener’s name takes precedence over using the group id.
zh_cn: 注意，设置消费者再平衡监听器的名称的方式要比使用组ID的方式优先被使用。

source: Setting the port
zh_cn: 设置端口

source: Setting up and configuring Hibernate ORM with Panache
zh_cn: 在Hibernate ORM中配置Panache

source: Setting up and configuring Hibernate Reactive with Panache
zh_cn: 在Hibernate Reactive中配置Panache

source: Setting up and configuring MongoDB with Panache
zh_cn: 使用Panache设置和配置MongoDB

source: Setting up support for Flyway
zh_cn: 建立对Flyway的支持

source: Share in our excitement when the project receives <a href="{{site.baseurl}}/awards">awards and recognition</a> for all of the hard work done by the community.
zh_cn: 因为社区所做的所有辛勤工作，当项目获得<a href="{{site.baseurl}}/awards">奖项和认可</a>时，分享我们的兴奋之情。

source: Shared broker
zh_cn: 共享的broker

source: Shared registry
zh_cn: 共享的注册表

source: Shared server
zh_cn: 服务共享

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.amqp.devservices.shared=false`.
zh_cn: 在开发模式下，默认启用共享，但在测试模式下禁用共享。你可以使用 `quarkus.amqp.devservices.shared=false` 来禁用共享。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.apicurio-registry.devservices.shared=false`.
zh_cn: 在开发模式下，默认启用共享，但在测试模式下默认禁用共享。你可以使用 `quarkus.apicurio-registry.devservices.shared=false` 来禁用共享。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.kafka.devservices.shared=false`.
zh_cn: 在开发模式下，共享是默认启用的，但在测试模式下是禁用的。您可以用 `quarkus.kafka.devservices.shared=false` 停用共享。

source: Sharing is enabled by default in dev mode, but disabled in test mode. You can disable the sharing with `quarkus.redis.devservices.shared=false`.
zh_cn: 在dev模式下默认启用服务共享，而在测试模式下默认禁用。也可以使用 `quarkus.redis.devservices.shared=false` 配置禁用服务共享。

source: Short informative videos that highlight unique technical points and instructions on how to get the most out of Quarkus.
zh_cn: 简短的信息视频突出了独特的技术要点和关于如何最大限度地利用Quarkus的说明。

source: Signature algorithm. Set it to `ES256` to support the Elliptic Curve signature algorithm.
zh_cn: 签名算法。将其设置为 `ES256` ，以支持椭圆曲线签名算法。

source: Signature algorithm. This property should only be used for setting a required symmetric algorithm such as `HS256`. It is deprecated for setting asymmetric algorithms such as `ES256` - use 'mp.jwt.verify.publickey.algorithm' instead.
zh_cn: 签名算法。此属性只能用于设置所需的对称算法，如 `HS256` 。对于设置非对称算法，如已被弃用的 `ES256` - 请使用 `mp.jwt.verify.publickey.algorithm` 代替。

source: Similar to the Maven configuration, when using Gradle, the following modifications are required when Kotlin is selected:
zh_cn: 与Maven的配置类似，在使用Gradle时，如果选择了Kotlin，则需要做以下修改：

source: Similar to the previous example, multiple instances of an application can subscribe to a single consumer group, configured via `mp.messaging.incoming.$channel.group.id` property, or left default to the application name. This in turn will divide partitions of the topic among application instances.
zh_cn: 与前面的例子类似，一个应用程序的多个实例可以订阅同一个消费者组。这种方式可以通过 `mp.messaging.incoming.$channel.group.id` 进行配置，或默认为应用程序的名称。这种方式会在应用程序实例之间分配topic的分区。

source: Similarly for Gradle projects, you also just have to add the `quarkus-amazon-lambda` dependency. The extension automatically generates everything you might need for your lambda deployment.
zh_cn: 同样，对于Gradle项目，你也只需添加 `quarkus-amazon-lambda` 依赖项。该扩展会为你的lambda部署自动生成可能需要的一切。

source: Similarly, if you declare
zh_cn: 同样地，如果您声明

source: Simple SAM Local Principal
zh_cn: 简单的SAM本地主体

source: Simplified Hibernate ORM with Panache
zh_cn: 使用Panache简化Hibernate ORM

source: Simplified Hibernate ORM with Panache and Kotlin
zh_cn: 用Panache和Kotlin简化Hibernate ORM

source: Simplified Hibernate Reactive with Panache
zh_cn: 使用Panache简化Hibernate Reactive

source: Simplified MongoDB with Panache
zh_cn: 使用Panache简化MongoDB

source: Simplified MongoDB with Panache and Kotlin
zh_cn: 用Panache和Kotlin简化MongoDB

source: Simplified queries
zh_cn: 简化查询

source: Simplified reactive ORM layer based on Hibernate Reactive.
zh_cn: 基于Hibernate 响应式的简化响应式ORM层。

source: Simplify command line applications creation with the Picocli extension.
zh_cn: 用Picocli扩展简化了命令行应用程序的创建。

source: Simplifying MongoDB Client usage using BSON codec
zh_cn: 使用BSON编解码器简化MongoDB客户端的使用

source: Simplifying MongoDB with Panache
zh_cn: 用Panache简化MongoDB

source: Simulate Amazon Lambda Deployment with SAM CLI
zh_cn: 用SAM CLI模拟Amazon Lambda部署

source: Since the `mockableBean2` mock has not been configured, it will return the default Mockito response.
zh_cn: 由于 `mockableBean2` mock还没有被配置，它将返回默认的Mockito响应。

source: Since we configured `greetingService` as a mock, the `GreetingResource` which uses the `GreetingService` bean, we get the mocked response instead of the response of the regular `GreetingService` bean
zh_cn: 由于我们将 `greetingService` 配置为一个mock，那么在使用了 `GreetingService` Bean的 `GreetingResource` 中，我们得到的是mock的响应，而不是正常的 `GreetingService` Bean的响应

source: Since we’re not limited to standards we can go beyond and extend your possibilities. Of course, Quarkus is not a passive consumer. Our goal is to improve and innovate the technologies we use and contribute back to the open source projects and standards we rely on.
zh_cn: 由于我们不受标准的限制，我们可以超越并扩展您的可能性。当然，Quarkus不是一个被动的消费者。我们的目标是改进和创新我们所使用的技术，并为我们所依赖的开源项目和标准做出贡献。

source: Single Page Application (SPA) typically uses `XMLHttpRequest`(XHR) and the JavaScript utility code provided by the OpenID Connect provider to acquire a bearer token and use it to access Quarkus `service` applications.
zh_cn: 单页应用程序（SPA）通常使用 `XMLHttpRequest` （XHR）和OpenID Connect提供商提供的Java Script实用程序代码来获取不记名令牌，并使用它来访问Quarkus `service` 应用程序。

source: Single Page Applications
zh_cn: 单页应用程序

source: Single-step Deployments
zh_cn: 单步执行部署

source: Size
zh_cn: 大小

source: SmallRye JWT provides more properties which can be used to customize the token processing:
zh_cn: SmallRye JWT提供了更多的属性，可以用来定制令牌的处理:

source: So far in all our examples we only start Quarkus once for all tests. Before the first test is run Quarkus will boot, then all tests will run, then Quarkus will shut down at the end. This makes for a very fast testing experience however it is a bit limited as you can't test different configurations.
zh_cn: 到目前为止，在我们所有的例子中，我们只为所有的测试启动Quarkus一次。在第一个测试运行之前，Quarkus会启动，然后所有测试都会在这次启动中运行，最后Quarkus会关闭。这使得测试体验非常快，但是它有一点局限性，因为您无法测试不同的配置。

source: So far we have only covered integration style tests that test the app via HTTP endpoints, but what if we want to do unit testing and test our beans directly?
zh_cn: 到目前为止，我们只涉及了通过HTTP节点测试应用程序的集成式测试，但如果我们想做单元测试并直接测试我们的Bean又该怎么办？

source: So far, we have used the Vert.x Core API. Vert.x offers much more. It provides a vast ecosystem. In this section, we will see how you can use the Vert.x Web Client, a reactive HTTP client.
zh_cn: 到目前为止，我们已经使用了 Vert.x 核心 API。 Vert.x 提供的不仅仅是这些。它提供了一个广阔的生态系统。在本节中，我们将会带你了解如何使用 Vert.x Web 客户端 - 一个响应式 HTTP 客户端。

source: So now let's actually secure something. Take a look at the new endpoint method `helloRolesAllowed` in the following:
zh_cn: 所以，现在让我们真正让一些东西变得安全。看看下面的新端点方法 `helloRolesAllowed` ：

source: So use SockJS, you need to configure the bridge, especially the addresses that will be used to communicate:
zh_cn: 因此，使用SockJS，你需要配置桥梁，特别是将用于通信的地址：

source: So when you access the `/q/health/ready` endpoint of your application you will have information about the connection validation status.
zh_cn: 因此，当你访问你的应用程序的 `/q/health/ready` 端点时，您将获得有关连接验证状态的信息。

source: So when you access the `/q/metrics` endpoint of your application you will have information about the connection pool status. When using xref:smallrye-metrics.adoc[SmallRye Metrics], connection pool metrics will be available under the `vendor` scope.
zh_cn: 因此，当你访问你的应用程序的 `/q/metrics` 端点时，你将得到有关连接池状态的信息。当使用 link:smallrye-metrics.html[SmallRye Metrics] 时，连接池指标将在 `vendor` 范围内可用。

source: So, unlike the imperative model, where I/O blocks the execution, reactive switches to a continuation-based design, where the I/O threads are released, and continuation invoked when the I/Os complete. As a result, the I/O thread can handle multiple concurrent requests, improving the overall concurrency of the application.
zh_cn: 因此，与I/O阻塞执行的指令式模型不同，响应式切换到基于延续的设计，其中I/O线程被释放，而延续在I/O完成时被调用。因此，I/O线程可以处理多个并发请求，从而提高应用程序的整体并发性。

source: So, with the reactive execution model, the requests are processed using I/O threads. But that's not all. An I/O thread can handle multiple concurrent requests. How? Here is the trick and one of the most significant differences between reactive and imperative.
zh_cn: 因此，使用响应式执行模型，请求是使用I/O线程处理的。但这还不是全部。一个I/O线程可以处理多个并发请求。如何实现？这是一个技巧，也是响应式和指令式之间最重要的区别之一。

source: So, you should have the following files in your project:
zh_cn: 因此，你的项目中应该包含以下文件:

source: SockJS negotiates the communication channel between the Quarkus application and the browser. If WebSockets are supported, it uses them; otherwise, it degrades to SSE, long polling, etc.
zh_cn: SockJS负责协商Quarkus应用程序和浏览器之间的通信渠道。如果支持WebSockets，它就使用它们；否则，它就退化为SSE、long polling等。

source: Solution
zh_cn: 解决方案

source: Solution 1: using the active record pattern
zh_cn: 解决方案1：使用active record（活动记录）模式

source: Solution 2: using the repository pattern
zh_cn: 解决方案2：使用资源库模式

source: Solving this issue requires adding the `-H:DynamicProxyConfigurationResources=<comma-separated-config-resources>` option and to provide a dynamic proxy configuration file. You can find all the information about the format of this file in https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/DynamicProxy.md#manual-configuration[the GraalVM documentation].
zh_cn: 解决这个问题需要添加 `-H:DynamicProxyConfigurationResources=<comma-separated-config-resources>` 选项，并提供一个动态代理配置文件。你可以在 https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/DynamicProxy.md#manual-configuration[GraalVM文档]中找到关于这个文件格式的所有信息。

source: Some Quarkus extensions will require additional code to ensure traces are propagated to subsequent execution. These sections will outline what is necessary to propagate traces across process boundaries.
zh_cn: 一些Quarkus扩展需要额外的代码来确保traces被传播到后续执行中。以下章节将展示跨越进程边界传播traces的必要条件。

source: Some consumer client properties are configured to sensible default values:
zh_cn: 一些消费者客户端属性被配置为相对合理的默认值：

source: Some environment cuts the SSE connection when there is not enough activity. The workaround consists of sending _ping_ messages (or empty objects) periodically.
zh_cn: 当没有足够的活跃度时，一些环境会切断SSE的连接。替代方法则是定期发送 _ping_ 消息(或空对象)。

source: Some extensions, for example, `OIDC`, `OAuth2`, and `SmallRye JWT` have inline `IdentityProvider` implementations specific to the supported authentication flow. For example, `quarkus-oidc` uses its own `IdentityProvider` to convert a token to a `SecurityIdentity` instance.
zh_cn: 一些扩展如 `OIDC` 、 `OAuth2` 以及 `SmallRye JWT` 有内联的 `IdentityProvider` 实现来针对支持的认证流程的。例如， `quarkus-oidc` 使用它自己的 `IdentityProvider` 来将token转换为 `SecurityIdentity` 实例。

source: Some familiarity with the Spring Web extension
zh_cn: 对Spring Web扩展有一定的熟悉程度

source: Some previous releases of GraalVM included the `native-image` tool by default. This is no longer the case; it must be installed as a second step after GraalVM itself is installed. Note: there is an outstanding issue xref:graal-and-catalina[using GraalVM with macOS Catalina].
zh_cn: GraalVM以前的一些版本默认包括 `native-image` 工具。现在已经不是这样了，它必须在安装完GraalVM本身后作为第二步来安装。注意：一个已知的问题 xref:graal-and-catalina[在MacOS Catalina上使用GraalVM]。

source: Some producer client properties are configured to sensible default values:
zh_cn: 一些生产者客户端属性被配置为合理的默认值：

source: Some properties have aliases which can be configured globally:
zh_cn: 有些属性拥有可以进行全局配置的别名：

source: Some use cases will require custom configuration of OpenTelemetry. These sections will outline what is necessary to properly configure it.
zh_cn: 有些情况下需要对OpenTelemetry进行自定义配置。以下章节将展示如何对一些必要的属性进行正确配置。

source: Some vendor-specific protocols need a custom ID Generator, you can override the default one by creating a producer. The OpenTelemetry extension will detect the `IdGenerator` CDI bean and will use it when configuring the tracer producer.
zh_cn: 一些供应商特定协议需要一个自定义的ID生成器，您可以通过创建一个自定义生成器来覆盖默认的ID。OpenTelemetry扩展将检测 `IdGenerator` CDI Bean，并在配置tracer生成器时使用它。

source: Sometimes it is desirable to select the destination of a message dynamically. In this case, you should not configure the address inside your application configuration file, but instead, use the outbound metadata to set the address.
zh_cn: 有时，需要动态选择消息的目的地。在这种情况下，你不应该在你的应用程序配置文件中配置地址，而应该使用出站元数据来设置地址。

source: Sometimes when testing you only need to verify that a certain logical path was taken, or you only need to stub out a single method's response while still executing the rest of the methods on the Spied clone. Please see link:https://javadoc.io/doc/org.mockito/mockito-core/latest/org/mockito/Mockito.html#spy-T-[Mockito documentation] for more details on Spy partial mocks. In either of those situations a Spy of the object is preferable. Using `@InjectSpy`, the previous example could be written as follows:
zh_cn: 有时在测试时您只需要验证某个逻辑路径，或者您只想对某一个方法的响应进行stub，同时仍保持执行Spied clone上的其他方法。关于Spy部分mock的更多细节，请参见 link:https://javadoc.io/doc/org.mockito/mockito-core/latest/org/mockito/Mockito.html#spy-T-[Mockito文档] 。在这两种情况下，推荐使用针对对象的Spy。使用 `@InjectSpy` ，前面的例子可以写成这样：

source: Sometimes you need more than just handling messages one by one. You can also express your message processing logic using reactive programming as illustrated in the following snippet:
zh_cn: 有时你需要的不仅仅是逐一处理消息。你也可以使用响应式编程来表达消息处理逻辑，如下面的片段所示：

source: Sometimes, though, you might have a few related lambdas that share code and creating multiple maven modules is just an overhead you don't want to do. The `quarkus-amazon-lambda` extension allows you to bundle multiple lambdas in one project and use configuration or an environment variable to pick the handler you want to deploy.
zh_cn: 但有时，你可能会有几个共享代码的相关lambdas，创建多个maven模块是你不想做的开销。 `quarkus-amazon-lambda` 扩展允许你在一个项目中捆绑多个lambdas，并使用配置或环境变量来选择你要部署的处理程序。

source: Sometimes, you need to have an imperative way of sending messages.
zh_cn: 有时，您需要使用命令式的方式来发送消息。

source: Sorting
zh_cn: 排序

source: Source
zh_cn: 源代码

source: Sources for third party jar dependencies, including Quarkus source code, are not added to the source cache by default. To include those, make sure you invoke `mvn dependency:sources` first. This step is required in order to pull the sources for these dependencies, and get them included in the source cache.
zh_cn: 第三方jar依赖的源，包括Quarkus源代码，默认情况下不会被添加到源缓存中。要包括这些，请确保你先调用 `mvn dependency:sources` 。这一步是必须的，以便拉出这些依赖的源代码，并将其包含在源代码缓存中。

source: Specify the commit strategy to apply when a message produced from a record is acknowledged. Values can be `latest`, `ignore` or `throttled`. If `enable.auto.commit` is true then the default is `ignore` otherwise it is `throttled` Type: _string_
zh_cn: 记录产生的消息被确认时的提交策略。值可以是 `latest` , `ignore` 或 `throttled` 。如果 `enable.auto.commit` 为真，则默认为 `ignore` ，否则为 `throttled` 类型: _string_

source: Specify the failure strategy to apply when a message produced from a record is acknowledged negatively (nack). Values can be `fail` (default), `ignore`, or `dead-letter-queue` Type: _string_
zh_cn: 当记录产生的消息未被确认（nack）时要应用的失败策略。值可以是 `fail` （默认）， `ignore` ，或 `dead-letter-queue` 类型: _string_

source: Specify the failure strategy to apply when a message produced from an AMQP message is nacked. Accepted values are `fail` (default), `accept`, `release`, `reject`, `modified-failed`, `modified-failed-undeliverable-here` Type: _string_
zh_cn: 当从AMQP消息中产生的消息为不被认可时，指定要应用的失败策略。可接受的值是 `fail` （默认）， `accept` ， `release` ， `reject` ， `modified-failed` ， `modified-failed-undeliverable-here` 类型: _string_

source: Spring Boot `@ConfigurationProperties` has a few limitations. For instance, `Map` injection is not supported. Consider using xref:config-mappings.adoc[Mapping configuration to objects].
zh_cn: Spring Boot `@ConfigurationProperties` 有一些限制。例如，不支持 `Map` 注入。你可以考虑使用 link:config-mappings.html[将配置映射到对象] 。

source: Spring Cloud Config Client Reference
zh_cn: Spring Cloud 配置客户端参考

source: Spring Data REST simplifies the creation of CRUD applications based on our Spring Data compatibility layer.
zh_cn: Spring Data REST简化了基于我们Spring Data兼容层的CRUD应用程序的创建。

source: Stable
zh_cn: 稳定版

source: Stand up a Config Server
zh_cn: 建立一个配置服务器

source: Standards
zh_cn: 标准

source: Start AMQP automatically in dev and test modes.
zh_cn: 在开发和测试模式下自动启动AMQP。

source: Start Apache Kafka automatically in dev and test modes.
zh_cn: 在开发和测试模式下自动启动Apache Kafka。

source: Start Apicurio Registry automatically in dev and test modes.
zh_cn: 在开发和测试模式下自动启动Apicurio仓库。

source: Start Elasticsearch automatically in dev and test modes.
zh_cn: 在开发和测试模式下自动启动Elasticsearch。

source: Start Keycloak or other providers automatically in dev and test modes.
zh_cn: 在开发和测试模式下自动启动Keycloak或其他提供者。

source: Start Kogito automatically in dev and test modes.
zh_cn: 在开发和测试模式下自动启动Kogito。

source: Start RabbitMQ automatically in dev and test modes.
zh_cn: 在开发和测试模式下自动启动 RabbitMQ。
